In [1]:
import pandas as pd
import numpy as np

# Pandas Method

## Importing The Datasets

In [2]:
df = pd.read_csv("Data.csv")
df.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

## Dummies, Factorize

In [3]:
df.Country = pd.factorize(df.Country)[0]
df.Purchased = pd.factorize(df.Purchased)[0]
dummies = pd.get_dummies(df.Country,drop_first=True)
df = pd.concat([dummies,df.drop("Country",axis=1)],axis=1)

In [4]:
print("Unique values: \n{}".format(df.nunique()))
print("Desciption: \n{}".format(df.describe()))
print("Index: \n{}".format(df.index))
print("Count: \n{}".format(df.count()))
df

Unique values:
1            2
2            2
Age          9
Salary       9
Purchased    2
dtype: int64
Desciption:
               1          2        Age        Salary  Purchased
count  10.000000  10.000000   9.000000      9.000000  10.000000
mean    0.300000   0.300000  38.777778  63777.777778   0.500000
std     0.483046   0.483046   7.693793  12265.579662   0.527046
min     0.000000   0.000000  27.000000  48000.000000   0.000000
25%     0.000000   0.000000  35.000000  54000.000000   0.000000
50%     0.000000   0.000000  38.000000  61000.000000   0.500000
75%     0.750000   0.750000  44.000000  72000.000000   1.000000
max     1.000000   1.000000  50.000000  83000.000000   1.000000
Index:
RangeIndex(start=0, stop=10, step=1)
Count:
1            10
2            10
Age           9
Salary        9
Purchased    10
dtype: int64

   1  2   Age   Salary  Purchased
0  0  0  44.0  72000.0          0
1  1  0  27.0  48000.0          1
2  0  1  30.0  54000.0          0
3  1  0  38.0  61000.0          0
4  0  1  40.0      NaN          1
5  0  0  35.0  58000.0          1
6  1  0   NaN  52000.0          0
7  0  0  48.0  79000.0          1
8  0  1  50.0  83000.0          0
9  0  0  37.0  67000.0          1

## Handling Missing Values and Scaling

In [5]:
df["Age"].isnull().any()

True

In [6]:
df["Age"].fillna(value=df.Age.mean(),axis = 0,inplace=True,)
df["Salary"].fillna(value = df.Salary.mean(),axis = 0,inplace = True)
print("Null if any :  \n{}".format(df.isnull().any()))
df.iloc[:,0:-1] = (df.iloc[:,0:-1] - df.iloc[:,0:-1].mean())/df.iloc[:,0:-1].std()

Null if any :
1            False
2            False
Age          False
Salary       False
Purchased    False
dtype: bool

In [7]:
X = df.iloc[:,0:-1].values
y = df.iloc[:,df.shape[1]-1].values

# Sklearn Method

In [9]:
from sklearn.preprocessing import StandardScaler, Imputer, LabelEncoder, OneHotEncoder

In [99]:
df = pd.read_csv("Data.csv")
df.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [100]:
X = df.iloc[:,0:-1].values
y = df.iloc[:,df.shape[1]-1].values

## Missing values

In [101]:
from sklearn.impute import SimpleImputer

In [102]:
from sklearn.compose import ColumnTransformer

In [103]:
si = SimpleImputer()
X[:,1:X.shape[1]] = imp.fit_transform(X[:,1:X.shape[1]])

In [47]:
imp = Imputer(missing_values='NaN',strategy='mean',axis = 0)
X[:,1:X.shape[1]] = imp.fit_transform(X[:,1:X.shape[1]])

In [71]:
L_enc_x = LabelEncoder()
X[:,0] = L_enc_x.fit_transform(X[:,0])
O_enc = OneHotEncoder(categorical_features=[0])
X = O_enc.fit_transform(X).toarray()
L_enc_y = LabelEncoder()
y = L_enc_y.fit_transform(y)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\preprocessing\_encoders.py:368: FutureWarning: The handling of integer data will change in version 0.22. Currently, the categories are determined based on the range [0, max(values)], while in the future they will be determined based on the unique values.
If you want the future behaviour and silence this warning, you can specify "categories='auto'".
In case you used a LabelEncoder before this OneHotEncoder to convert the categories to integers, then you can now use the OneHotEncoder directly.
  warnings.warn(msg, FutureWarning)

In [104]:
CT = ColumnTransformer([("Dummies",OneHotEncoder(),[0])],remainder='passthrough')
X = CT.fit_transform(X)
L_enc_y = LabelEncoder()
y = L_enc_y.fit_transform(y)

In [136]:
syms = np.genfromtxt('Data.csv', dtype=str, delimiter=',')[:,1:]